constexpr int PIN1 = 0;

struct Cursor{
    int x=0,y=0;
}

std::string characters[5][11]{
    {"あ","い","う","え","お"},
    {"か","き","く","け","こ"},
    {"さ","し","す","せ","そ"},
    {"た","ち","つ","て","と"},
    {"な","に","ぬ","ね","の"},
    {"は","ひ","ふ","へ","ほ"},
    {"ま","み","む","め","も"},
    {"や","ゐ","ゆ","ゑ","よ"},
    {"ら","り","る","れ","ろ"},
    {"わ","　","を","　","ん"},
    {"゛", "゜", "削除", "改行", "終了"}
};

void setup(){
    //Serial.begin(9600);
    //pinMode(PIN1, INPUT_PULLUP);
}

void loop(){
    static int cursor{0,0};
}